package com.r214.ml;

import com.googlecode.fannj.Fann;

import java.util.Scanner;

/**
 * Created by vlad on 02/05/2017.
 */
public class CheckResults {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        Fann fann = new Fann("ann");

        float[][] tests = {
                {3199, 4816, 0, 100, 13, 2, 8, 1, 184, 0, 0, 0, 1, 0, 0},
                {6143, 9820, 562, 1399, 4807, 3830, 16, 1, 539, 0, 0, 1, 0, 1, 1},
                {8260, 3099, 0, 335, 2720, 3574, 3, 0, 201, 0, 0, 1, 0, 1, 1},
                {803, 3163, 0, 113, 327, 925, 0, 0, 40, 0, 0, 1, 0, 1, 1},
                {1053, 59, 10, 3, 1, 205, 0, 0, 228, 0, 0, 0, 0, 0, 1},
                {457, 0, 418, 89, 1, 3, 0, 0, 378, 0, 0, 1, 0, 0, 0},
                {15, 5, 3, 0, 1, 11, 0, 0, 118, 0, 0, 0, 1, 0, 0},
                {424, 2, 26, 3, 15, 35, 2, 0, 33, 0, 1, 1, 1, 0, 0},
                {233, 6, 0, 57, 2, 0, 0, 0, 80, 0, 0, 0, 1, 0, 0},
                {141, 14, 0, 0, 1, 51, 0, 0, 427, 0, 0, 0, 1, 0, 0},
                {202, 0, 4, 4, 38, 1, 0, 0, 12, 0, 0, 1, 1, 0, 0},
                {120, 125, 1440, 294, 6, 54, 0, 0, 155, 0, 1, 0, 1, 1, 0},
                {297, 286, 1451, 27, 117, 101, 2, 0, 165, 0, 1, 1, 1, 1, 0},
                {227, 25, 159, 30, 20, 21, 0, 0, 25, 0, 1, 1, 1, 1, 0},
                {131, 75, 200, 104, 284, 19, 0, 0, 47, 0, 1, 1, 1, 1, 0},
                {750, 524, 3720, 1739, 157, 247, 0, 0, 52, 0, 1, 1, 1, 1, 0},
                {197, 421, 987, 214, 372, 113, 0, 0, 120, 0, 1, 1, 1, 1, 0},
                {279, 105, 3681, 423, 109, 69, 1, 0, 47, 0, 1, 1, 1, 1, 0},
                {507, 248, 1630, 103, 75, 102, 0, 0, 105, 0, 1, 1, 1, 1, 0},
                {162, 106, 2275, 1713, 37, 24, 0, 0, 41, 0, 1, 1, 1, 1, 0},
                {1108, 13, 0, 0, 5, 222, 0, 0, 99, 0, 1, 0, 1, 1, 1}
        };

//        for (float[] test : tests) {
//            System.out.println(getAction(fann.run(test)));
//        }


        String[] titles = {"друзья", "подписчики", "аудиозаписи", "видеозаписи", "фото", "лайков на аве", "постов за неделю", "постов за месяц >50?", "интересные страницы", "галочка", "картинка(0) или фото(1)", "личная инфо (работа, город, учеба)", "имя", "подарки", "репосты"};
        float[] test = new float[15];

        for (int i = 0; i < titles.length; i++) {
            System.out.print(titles[i] + ": ");

            String input = scanner.nextLine();
            test[i] = Float.parseFloat(input);
        }
        System.out.println("Результат: " + getAction(fann.run(test)));
    }

    private static String getAction(float[] out) {
        return (out[0] < 0.5f ? "не фейк" : "фейк") + " (вероятность " + Math.round((out[0] < 0.5f ? 1 - out[0] : out[0]) * 100.f) + "%)";
    }

}
